tutorials/phaseChangeMaterial4NFFoam/wavyChamberHybridHomogenous/constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//


//************************************************ baseFluid ************************************************//
baseFluid			(lauricAcid);
baseFluidDynamicViscosityModel  Newtonian;
moleFraction			(1.0);
#include "../../../materialsDict.H";


//************************************************ particle ************************************************//
particle			( (Cu MNP) (MWCNT MNP) );
particleDict
{
    Cu
    {
        Components		(Cu);
        moleFraction		(1.0);
    }

    MWCNT
    {
        Components		(MWCNT);
        moleFraction		(1.0);
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(hybrid Homogenous);
thermalConductivityModel	Devi;
DeviCoeffs
{
    lambda			(3.0 3.0);
}

dynamicViscosityModel		hybridBrinkman;
hybridBrinkmanCoeffs{}


//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(33.0e-9 66e-9);
}

thermophoresisDiffusivityModel		McNabMeisen;
McNabMeisenCoeffs{}


//############################################### End #######################################################//
